# RebarShapeConstraintFixedSegmentDir Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeConstraintFixedSegmentDir Constructor
RebarShapeConstraintFixedSegmentDir Class See Also
---
Create a fixed segment direction constraint.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public RebarShapeConstraintFixedSegmentDir(
	UV dir
)
```

Visual Basic
---
```text
Public Sub New ( _
	dir As UV _
)
```

Visual C++
---
```text
public:
RebarShapeConstraintFixedSegmentDir(
	UV^ dir
)
```

# ### Parameters
dir
    Type: Autodesk.Revit.DB..::..UV A fixed direction in UV-space.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | dir has zero length. |

# See Also
RebarShapeConstraintFixedSegmentDir Class
Autodesk.Revit.DB.Structure Namespace